docs/get_pass.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-07 Wed 19:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>get_pass</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">get_pass</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org763d910">NAME</a></li>
<li><a href="#orga28fec9">SYNOPSIS</a></li>
<li><a href="#org010a4c8">DESCRIPTION</a>
<ul>
<li><a href="#org15fceb4">Optional Arguments</a></li>
<li><a href="#org72efca0">Optional Positional Argument:</a></li>
</ul>
</li>
<li><a href="#org2bfa3c9">SEE ALSO</a></li>
</ul>
</div>
</div>


<div id="outline-container-org763d910" class="outline-2">
<h2 id="org763d910">NAME</h2>
<div class="outline-text-2" id="text-org763d910">
<p>
get_pass - update password_store, fetch password.
</p>
</div>
</div>

<div id="outline-container-orga28fec9" class="outline-2">
<h2 id="orga28fec9">SYNOPSIS</h2>
<div class="outline-text-2" id="text-orga28fec9">
<p>
get_pass -h
</p>

<p>
get_pass &#x2013;help
</p>

<p>
get_pass [Optional Arguments*] [INSTANCE]
</p>
</div>
</div>

<div id="outline-container-org010a4c8" class="outline-2">
<h2 id="org010a4c8">DESCRIPTION</h2>
<div class="outline-text-2" id="text-org010a4c8">
<p>
Update password store git repository, then, fetch password from password-store.
If instance is not provided, list available instances.
</p>
</div>


<div id="outline-container-org15fceb4" class="outline-3">
<h3 id="org15fceb4">Optional Arguments</h3>
<div class="outline-text-3" id="text-org15fceb4">
<p>
-h               print usage message and exit
</p>

<p>
&#x2013;help           print this help message and exit
</p>

<p>
&#x2013;&lt;passargs&gt;     all passargs are passed to <code>pass</code>.
</p>
</div>
</div>

<div id="outline-container-org72efca0" class="outline-3">
<h3 id="org72efca0">Optional Positional Argument:</h3>
<div class="outline-text-3" id="text-org72efca0">
<p>
INSTANCE    fetch password from password store for INSTANCE
</p>
</div>
</div>
</div>

<div id="outline-container-org2bfa3c9" class="outline-2">
<h2 id="org2bfa3c9">SEE ALSO</h2>
<div class="outline-text-2" id="text-org2bfa3c9">
<ul class="org-ul">
<li>pass</li>
</ul>
</div>
</div>
</div>
</body>
</html>
